server/app/controllers/api/v1/auth_controller.rb

    def create

      @user = User.find_by(username: user_login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "data"], ["LIMIT", 1]]

    def show
      token = request.headers['Authorization'].split(' ')[1]
      begin
        JWT.decode(token, 'my_s3cr3t', true, algorithm: 'HS256')
        user_id = decoded_token[0]['user_id']
        user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]