Vinology-server/app/controllers/api/v1/queries_controller.rb

INSERT INTO "queries" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Daniel"], ["user_id", 1], ["created_at", "2021-11-22 14:36:23.833349"], ["updated_at", "2021-11-22 14:36:23.833349"]]
---
    def create
      query = Query.create(user_id: query_params[:user_id], name: query_params[:name])

SELECT "queries".* FROM "queries"
---
    def index
      queries = Query.all

SELECT "queries".* FROM "queries" WHERE "queries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "queries" SET "name" = ?, "updated_at" = ? WHERE "queries"."id" = ?  [["name", "jjj"], ["updated_at", "2021-11-23 14:01:09.607017"], ["id", 1]]
---
  def update

      query = Query.find_by(id: params[:id])

      query.update(name: query_params[:name])

SELECT "queries".* FROM "queries" WHERE "queries"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "queries" WHERE "queries"."id" = ?  [["id", 3]]
---
  def destroy

    query = Query.find_by(id: params[:id])

    query.delete