Vinology-server/app/controllers/api/v1/users_controller.rb

    def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("email", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)